
## Plan Result (prod_vpn_gateway)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.shared_key[0]
  * azurerm_local_network_gateway.lab[0]
  * azurerm_public_ip.this[0]
  * azurerm_resource_group.this[0]
  * azurerm_virtual_network_gateway.this[0]
  * azurerm_virtual_network_gateway_connection.lab-s2s[0]
  * random_password.shared_key[0]
  * module.networking[0].azurerm_subnet.this[&#34;vpn-gateway&#34;]
  * module.networking[0].azurerm_virtual_network.this[&#34;vpn&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.shared_key[0] will be created
  + resource "azurerm_key_vault_secret" "shared_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault"
      + name                    = "lab-vpn-prod-shared-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_local_network_gateway.lab[0] will be created
  + resource "azurerm_local_network_gateway" "lab" {
      + address_space       = [
          + "10.151.0.0/18",
        ]
      + gateway_address     = (sensitive value)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "lab-vpn-prod-local-gateway"
      + resource_group_name = "lab-vpn-prod-rg"
    }

  # azurerm_public_ip.this[0] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Dynamic"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "lab-vpn-prod-public-ip"
      + resource_group_name     = "lab-vpn-prod-rg"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.this[0] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "lab-vpn-prod-rg"
    }

  # azurerm_virtual_network_gateway.this[0] will be created
  + resource "azurerm_virtual_network_gateway" "this" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "uksouth"
      + name                                  = "lab-vpn-prod-gateway"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "lab-vpn-prod-rg"
      + sku                                   = "Basic"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "vnetGatewayConfig"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_virtual_network_gateway_connection.lab-s2s[0] will be created
  + resource "azurerm_virtual_network_gateway_connection" "lab-s2s" {
      + connection_mode                    = "Default"
      + connection_protocol                = "IKEv2"
      + enable_bgp                         = (known after apply)
      + express_route_gateway_bypass       = (known after apply)
      + id                                 = (known after apply)
      + local_network_gateway_id           = (known after apply)
      + location                           = "uksouth"
      + name                               = "lab-vpn-prod-s2s-connection"
      + private_link_fast_path_enabled     = false
      + resource_group_name                = "lab-vpn-prod-rg"
      + routing_weight                     = (known after apply)
      + shared_key                         = (sensitive value)
      + type                               = "IPsec"
      + use_policy_based_traffic_selectors = (known after apply)
      + virtual_network_gateway_id         = (known after apply)
    }

  # random_password.shared_key[0] will be created
  + resource "random_password" "shared_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.networking[0].azurerm_subnet.this["vpn-gateway"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.151.200.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "lab-vpn-prod-rg"
      + virtual_network_name                          = "lab-vpn-vpn-prod"
    }

  # module.networking[0].azurerm_virtual_network.this["vpn"] will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.151.200.0/24",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "lab-vpn-vpn-prod"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "lab-vpn-prod-rg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "application" = "vpn-gateway"
          + "environment" = "prod"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":451,"Program":"tfcmt","SHA1":"","Target":"prod_vpn_gateway","Vars":{}} -->